; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	thermograph4 - mode
	thermograph2 - mode
	infrared3 - mode
	infrared5 - mode
	thermograph1 - mode
	image0 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	GroundStation11 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation2 - direction
	Star9 - direction
	Star5 - direction
	Star8 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared5)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation11)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
)
(:goal (and
	(pointing satellite0 Planet13)
	(have_image Phenomenon12 image0)
	(have_image Planet13 thermograph2)
	(have_image Planet13 infrared3)
	(have_image Phenomenon14 infrared3)
	(have_image Phenomenon15 thermograph2)
	(have_image Phenomenon15 thermograph1)
))

)

; plan
1. (turn_to satellite0 star6 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star6)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 0 of 7
5. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 7
6. (calibrate satellite0 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 0 of 7
7. (turn_to satellite0 phenomenon12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 7
8. (take_image satellite0 phenomenon12 instrument2 image0)
   added: (have_image phenomenon12 image0)
   goals met: 1 of 7
9. (turn_to satellite0 phenomenon14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 7
10. (take_image satellite0 phenomenon14 instrument2 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 2 of 7
11. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 7
12. (take_image satellite0 phenomenon15 instrument2 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 3 of 7
13. (turn_to satellite0 planet13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet13)
   goals met: 4 of 7
14. (take_image satellite0 planet13 instrument2 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 5 of 7
15. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 5 of 7
16. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 7
17. (turn_to satellite0 star6 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star6)
   goals met: 4 of 7
18. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 4 of 7
19. (turn_to satellite0 phenomenon15 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 7
20. (take_image satellite0 phenomenon15 instrument0 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 5 of 7
21. (turn_to satellite0 planet13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet13)
   goals met: 6 of 7
22. (take_image satellite0 planet13 instrument0 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 7 of 7
